In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model

In [65]:
df=pd.read_csv('hiring.csv')

In [66]:
df.sample(5)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
7     eleven                    7.0                           8      80000
0        NaN                    8.0                           9      50000
6        ten                    NaN                           7      72000
3        two                   10.0                          10      65000
1        NaN                    8.0                           6      45000

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  6 non-null      object
 1   test_score(out of 10)       7 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 388.0+ bytes

In [68]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [69]:
from sklearn.preprocessing import LabelEncoder
for col in df.columns:
    if df[col].dtype == 'object':
        df[col]=LabelEncoder().fit_transform(df[col])
df.head()

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           6                    8.0                           9      50000
1           6                    8.0                           6      45000
2           1                    6.0                           7      60000
3           5                   10.0                          10      65000
4           2                    9.0                           6      70000

In [70]:
df.experience=df.experience.fillna(df.experience.mean())

In [71]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           6                    8.0                           9      50000
1           6                    8.0                           6      45000
2           1                    6.0                           7      60000
3           5                   10.0                          10      65000
4           2                    9.0                           6      70000
5           4                    7.0                          10      62000
6           3                    NaN                           7      72000
7           0                    7.0                           8      80000

In [72]:
df.rename(columns={"test_score(out of 10)":"test_score"},inplace=True)

In [73]:
df.test_score=df.test_score.fillna(df.test_score.mean())

In [74]:
df

   experience  test_score  interview_score(out of 10)  salary($)
0           6    8.000000                           9      50000
1           6    8.000000                           6      45000
2           1    6.000000                           7      60000
3           5   10.000000                          10      65000
4           2    9.000000                           6      70000
5           4    7.000000                          10      62000
6           3    7.857143                           7      72000
7           0    7.000000                           8      80000

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  8 non-null      int32
 1   test_score                  8 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int32(1), int64(2)
memory usage: 356.0 bytes

In [76]:
df

   experience  test_score  interview_score(out of 10)  salary($)
0           6    8.000000                           9      50000
1           6    8.000000                           6      45000
2           1    6.000000                           7      60000
3           5   10.000000                          10      65000
4           2    9.000000                           6      70000
5           4    7.000000                          10      62000
6           3    7.857143                           7      72000
7           0    7.000000                           8      80000

In [77]:
features=df.drop('salary($)',axis=1)

In [78]:
features

   experience  test_score  interview_score(out of 10)
0           6    8.000000                           9
1           6    8.000000                           6
2           1    6.000000                           7
3           5   10.000000                          10
4           2    9.000000                           6
5           4    7.000000                          10
6           3    7.857143                           7
7           0    7.000000                           8

In [79]:
df.rename(columns={"salary($)":"salary"},inplace=True)

In [80]:
output=df.salary

In [81]:
output

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [82]:
features

   experience  test_score  interview_score(out of 10)
0           6    8.000000                           9
1           6    8.000000                           6
2           1    6.000000                           7
3           5   10.000000                          10
4           2    9.000000                           6
5           4    7.000000                          10
6           3    7.857143                           7
7           0    7.000000                           8

In [83]:
from sklearn.linear_model import LinearRegression

In [84]:
reg=LinearRegression()

In [85]:
reg

LinearRegression()

In [86]:
reg.fit(features,output)

LinearRegression()

In [87]:
df

   experience  test_score  interview_score(out of 10)  salary
0           6    8.000000                           9   50000
1           6    8.000000                           6   45000
2           1    6.000000                           7   60000
3           5   10.000000                          10   65000
4           2    9.000000                           6   70000
5           4    7.000000                          10   62000
6           3    7.857143                           7   72000
7           0    7.000000                           8   80000

In [88]:
reg.predict([[5,8,10]])

C:\Users\HP\anaconda3\Lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([58815.3754092])

In [90]:
reg.predict([[2,2,2]])

C:\Users\HP\anaconda3\Lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([33303.72808304])